#ifndef FILE_H
#define FILE_H
#include <stdio.h>
#include "LR6_Dll.h"
#include <iostream>
#include <cstring>

struct Node;

//Формування ім'я файлу та параметрів
//Вхідні дані: ім'я, параметри відкриття файлу, параметр
//Вихідні дані відсутні
void Expension(char *, char *, char *);

//Збереження інформації у файл
//Вхідні дані: файлова змінна, вказівник на початок списку
//Вихідні дані відсутні
void Save(FILE *, Node *);

//Зчитування інформації з файлу
//Вхідні дані: файлова змінна
//Вихідні дані: вказівник на початок списку
Node *Read(FILE *);

//Запис у файл інформації в лінію
//Вхідні дані: файлова змінна, інформація
//Вихідні дані відсутні
void WriteLine(FILE *, double);

//Запис у файл інформації у стовпець
//Вхідні дані: файлова змінна, інформація
//Вихідні дані відсутні
void WriteColumn(FILE *, double);

#endif // FILE_H
